$(document).ready(function(){

    $('[data-toggle="popover"]').popover({
        trigger : 'hover',
        html : true,
        content: function () {
        var targetId = this.id;
        var address= targetId+".jpg";
        console.log(address);
        if(targetId=="sixth"){
        	return `<div><img src=${address} width="100%" height="100%"><p>فرض کنید که نرخ تبادل بین کشوری که مصرف‌کنندگان ، سیب را ترجیح می‌دهند و کشوری که مصرف‌کنندگان ، پرتقال را ترجیح می‌دهند در حال حاضر ۱: ۱ است اما سال آینده تغییر خواهد کرد که ۲: ۱ یا ۱: ۲ با احتمال برابر است. فرض کنید یک مصرف‌کننده سیب، یک سیب را با یک پرتقال از مصرف‌کننده پرتقال تبادل می‌کند. مصرف‌کننده سیب اکنون یک سیب را با یک پرتقال معاوضه کرده‌است که در سال آینده قیمت مورد انتظار آن ۱٫۲۵ سیب است. مصرف‌کننده پرتقال هم، اکنون یک پرتقال برای سیب داده‌است، که در سال آینده انتظار می‌رود ارزش آن ۱٫۲۵ پرتقال باشد؛ بنابراین هر دو به نظر می‌رسد که از مبادله به‌طور متوسط بهره‌مند شده‌اند. </p></div>`;
        }
        if (targetId=="seventh") {
        	return `<div><img src=${address} width="100%" height="100%"><p align="right">فرض کنید که نرخ تبادل بین کشوری که مصرف‌کنندگان ، سیب را ترجیح می‌دهند و کشوری که مصرف‌کنندگان ، پرتقال را ترجیح می‌دهند در حال حاضر ۱: ۱ است اما سال آینده تغییر خواهد کرد که ۲: ۱ یا ۱: ۲ با احتمال برابر است. فرض کنید یک مصرف‌کننده سیب، یک سیب را با یک پرتقال از مصرف‌کننده پرتقال تبادل می‌کند. مصرف‌کننده سیب اکنون یک سیب را با یک پرتقال معاوضه کرده‌است که در سال آینده قیمت مورد انتظار آن ۱٫۲۵ سیب است. مصرف‌کننده پرتقال هم، اکنون یک پرتقال برای سیب داده‌است، که در سال آینده انتظار می‌رود ارزش آن ۱٫۲۵ پرتقال باشد؛ بنابراین هر دو به نظر می‌رسد که از مبادله به‌طور متوسط بهره‌مند شده‌اند. </p></div>`;
        }
         if (targetId=="eigth") {
        	return `<div><img src=${address} width="100%" height="100%"><p>فرض کنید که نرخ تبادل بین کشوری که مصرف‌کنندگان ، سیب را ترجیح می‌دهند و کشوری که مصرف‌کنندگان ، پرتقال را ترجیح می‌دهند در حال حاضر ۱: ۱ است اما سال آینده تغییر خواهد کرد که ۲: ۱ یا ۱: ۲ با احتمال برابر است. فرض کنید یک مصرف‌کننده سیب، یک سیب را با یک پرتقال از مصرف‌کننده پرتقال تبادل می‌کند. مصرف‌کننده سیب اکنون یک سیب را با یک پرتقال معاوضه کرده‌است که در سال آینده قیمت مورد انتظار آن ۱٫۲۵ سیب است. مصرف‌کننده پرتقال هم، اکنون یک پرتقال برای سیب داده‌است، که در سال آینده انتظار می‌رود ارزش آن ۱٫۲۵ پرتقال باشد؛ بنابراین هر دو به نظر می‌رسد که از مبادله به‌طور متوسط بهره‌مند شده‌اند. </p></div>`;
        }
         if (targetId=="ninth") {
        	return `<div><img src=${address} width="100%" height="100%"><p>فرض کنید که نرخ تبادل بین کشوری که مصرف‌کنندگان ، سی</p></div>`;
        }
         if (targetId=="tenth") {
        	return `<div><img src=${address} width="100%" height="100%"><p>فرض کنید که نرخ تبادل بین کشوری که مصرف‌کنندگان ، سیب را ترجیح می‌دهند و کشوری که مصرف‌کنندگان ، پرتقال را ترجیح می‌دهند در حال حاضر ۱: ۱ است اما سال آینده تغییر خواهد کرد که ۲: ۱ یا ۱: ۲ با احتمال برابر است. فرض کنید یک مصرف‌کننده سیب، یک سیب را با یک پرتقال از مصرف‌کننده پرتقال تبادل می‌کند. مصرف‌کننده سیب اکنون یک سیب را با یک پرتقال معاوضه کرده‌است که در سال آینده قیمت مورد انتظار آن ۱٫۲۵ سیب است. مصرف‌کننده پرتقال هم، اکنون یک پرتقال برای سیب داده‌است، که در سال آینده انتظار می‌رود ارزش آن ۱٫۲۵ پرتقال باشد؛ بنابراین هر دو به نظر می‌رسد که از مبادله به‌طور متوسط بهره‌مند شده‌اند. </p></div>`;
        }
       }
        });
});
